
/*
дз-15
07.07.2019 
Юсупов Т.

*/
#include <iostream>
#include <string.h>
#include <Windows.h>
using namespace std;

int main(int argc, char** argv) {
	setlocale(LC_ALL, "RUS");
	

	cout << "theme: Homework - 15." << endl;
	cout << "date: 07.07.2019" << endl;
	cout << "author: Timur Y." << endl;
	cout << endl;
	cout << "Транслитератор v.1.0.1 Стабильная." << endl;
	cout << "Для доп.информации введите 'FAQ'." << endl;
	cout << "Для выхода введите 'quit'." << endl << endl;
	while(true){
	int k=0,i=0, n;
	
	char x1[40],x2[80],*px1,*px2,*pabcUs,*pabcRu;
	char abcUs[] = {
	' ','a','b','c','d','e','f','g','h','i','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z','\'',
	    'A','B','C','D','E','F','G','H','I','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z','j','J'
	};
	char abcRu[] = {
	' ','а','б','с','д','е','ф','г','х','и','к','л','м','н','о','п','к','р','с','т','у','в','в','х','й','з','ь',
	    'А','Б','С','Д','Е','Ф','Г','Х','И','К','Л','М','Н','О','П','К','Р','С','Т','У','В','В','Х','Й','З','j','J'
	};
	

	
	int size = strlen(abcUs)+1;
	
	puts( "\nEnter text (max 39 letters) ");
	SetConsoleCP(1251);  // добавил так как консоль не выводит написанный русский язык
	gets(x1);
	SetConsoleCP(866);   // добавил так как консоль не выводит написанный русский язык
//	puts(x2);

	px1 = x1;
	px2 = x2;

	pabcUs = abcUs;
	pabcRu = abcRu;

	n = strlen(x1)+1;

	
	
	while  (k<n)
	{
		if((*(px1+k) == 'q') && (*(px1+k+1) == 'u') && (*(px1+k+2) == 'i') && (*(px1+k+3) == 't'))
				{
					return 0;
					
				}
				
		if((*(px1+k) == 'F') && (*(px1+k+1) == 'A') && (*(px1+k+2) == 'Q'))
				{
					cout << "\nДобро пожаловать в программу 'Транслитератор v.1.0.1 Стабильная.'" << endl
						<< "Эта программа преобразовывает введеный текст с 'латиницы' на 'кириллицу'." << endl
						<< "\n\n"
						<< "Возможности программы: 1.   писать текст на кирилице или латинице."<<endl
						<< "                       1.2. преобразовывает только латиницу." << endl
						<< "                       2.   поддерживается возможность писать заглавными буквами" << endl
						<< "                       3.   выход из программы: написать 'quit' и нажать 'enter'" << endl
						<< "                       4.   FAQ - Отображает информацию о программе." << endl
						<< "                       5.   Пасхалка. Имя создателя в правиль. последов-сти.\n" << endl;
//					return 0;
					
				}
		bool po = false;
		
		for(int j = 0; j < size;j++)
		{
			
			if(*(px1+k) == *(abcUs+j))
			{
				if( ((*(px1+k) == 'y') && (*(px1+(k+1)) == 'u')) || ((*(px1+k) == 'Y') && (*(px1+(k+1)) == 'u')) || ((*(px1+k) == 'Y') && (*(px1+(k+1)) == 'U'))) 
				{
					if(*(px1+k) == 'y' && *(px1+(k+1)) == 'u')
					{
						*(px2+i) = 'ю';
						k += 2;
						i++;
						po = true;
					}else
					{
						*(px2+i) = 'Ю';
						k += 2;
						i++;
						po = true;
					}
				}
				
				else if ( (*(px1+k) == 'y' && *(px1+(k+1)) == 'o') || (*(px1+k) == 'Y' && *(px1+(k+1)) == 'o') || (*(px1+k) == 'Y' && *(px1+(k+1)) == 'O')) 
				{
					if(*(px1+k) == 'y' && *(px1+(k+1)) == 'o')
					{
						*(px2+i) = 'ё';
						k += 2;
						i++;
						po = true;
					}else
					{
						*(px2+i) = 'Ё';
						k += 2;
						i++;
						po = true;
					}
				}
				
				else if ( (*(px1+k) == 'y' && *(px1+(k+1)) == 'a') || (*(px1+k) == 'Y' && *(px1+(k+1)) == 'a') || (*(px1+k) == 'Y' && *(px1+(k+1)) == 'A'))
				{
					if(*(px1+k) == 'y' && *(px1+(k+1)) == 'a')
					{
						*(px2+i) = 'я';
						k += 2;
						i++;
						po = true;
					}else
					{
						*(px2+i) = 'Я';
						k += 2;
						i++;
						po = true;
					}
				}
				
				else if ( (*(px1+k) == 'y' && *(px1+(k+1)) == 'i') || (*(px1+k) == 'Y' && *(px1+(k+1)) == 'i') || (*(px1+k) == 'Y' && *(px1+(k+1)) == 'I'))
				{
					if(*(px1+k) == 'y' && *(px1+(k+1)) == 'i')
					{
						*(px2+i) = 'ы';
						k += 2;
						i++;
						po = true;
					}else
					{
						*(px2+i) = 'Ы';
						k += 2;
						i++;
						po = true;
					}
				}
				
				else if ( (*(px1+k) == 's' && *(px1+(k+1)) == 'h') || (*(px1+k) == 'S' && *(px1+(k+1)) == 'h') || (*(px1+k) == 'S' && *(px1+(k+1)) == 'H'))
				{
					if(*(px1+k) == 's' && *(px1+(k+1)) == 'h')
					{
						*(px2+i) = 'ш';
						k += 2;
						i++;
						po = true;
					}else
					{
						*(px2+i) = 'Ш';
						k += 2;
						i++;
						po = true;
					}
				}
				
				else if ( (*(px1+k) == 'c' && *(px1+(k+1)) == 'h') || (*(px1+k) == 'C' && *(px1+(k+1)) == 'h') || (*(px1+k) == 'C' && *(px1+(k+1)) == 'H'))
				{
					if(*(px1+k) == 's' && *(px1+(k+1)) == 'h')
					{
						*(px2+i) = 'ч';
						k += 2;
						i++;
						po = true;
					}else
					{
						*(px2+i) = 'Ч';
						k += 2;
						i++;
						po = true;
					}
				}
				
				else if ( (*(px1+k) == 'j' && *(px1+(k+1)) == '\'') || (*(px1+k) == 'J' && *(px1+(k+1)) == '\'') )
				{
					if(*(px1+k) == 'j' && *(px1+(k+1)) == '\'')
					{
						*(px2+i) = 'ж';
						k += 2;
						i++;
						po = true;
					}else
					{
						*(px2+i) = 'Ж';
						k += 2;
						i++;
						po = true;
					}
				}
				
				else if ((*(px1+k) == 'j') || (*(px1+k) == 'J'))
				{
					if((*(px1+k) == 'j'))
					{
						*(px2+i) = 'д';			
						*(px2+i+1) = 'ж';	
						k++;
						i += 2;
						po = true;
					}else
					{
						*(px2+i) = 'Д';
						*(px2+i+1) = 'ж';
						k++;
						i += 2;
						po = true;
					}
				}
				
				else if((*(px1+k) == 'T') && (*(px1+k+1) == 'i') && (*(px1+k+2) == 'm') && (*(px1+k+3) == 'u') && (*(px1+k+4) == 'r'))
				{
					*(px2+i) = 'С';
					*(px2+i+1) = 'о';
					*(px2+i+2) = 'з';
					*(px2+i+3) = 'д';
					*(px2+i+4) = 'а';
					*(px2+i+5) = 'т';
					*(px2+i+6) = 'е';
					*(px2+i+7) = 'л';
					*(px2+i+8) = 'ь';
					
					k += 5;
					i += 9;
					po = true;
					
				}
				else{
					*(px2+i) = *(abcRu+j);
					 
		
					i++;
					k++;
					po = true;
				}
				
			}
							
		}
		
		
		if(!po)
		{
			*(px2+i) = *(px1+k);
			i++;
			k++;
		}
	}
	
	puts(x2);
	
	}



	return 0;
}
