#include <iostream>
using namespace std;
/* run this program using the console pauser or add your own getch, system("pause") or input loop */

int main() {
	setlocale(LC_ALL, "");
	
	/*8.	**Создать приложение, которое выводит на консоль фразу:*/
	cout << "\"U lukomor'a dub zelenij,\n\a\a\a"
 			"Zlataya zep na dupe tom,\n\a\a\a"
 			"I dnem i nochju kot uchenij\n\a\a\a"
 	 		"vse hodit po cepi krugom\"\n\n\n\a\a\a";
 	 		

	/*9.	**Создать приложение, которое выводит на консоль фразу:*/
	cout << "\"Lish u teba poet\n\a";
 	cout << "\tKrilatij slova zvuk,\n\a";
 	cout << "\t\thvataet na letu\n\a";
 	cout << "\t\t\tI zakreplaet vdrug - \n\a";
 	cout << "\t\t\t\tTo tomnij bred dushi,\n\a";
 	cout << "\t\t\t\t\tto trav neasnij zapah\"\n\n\n\a";
 	
 	
 	/*10.	***Создать приложение, которое выводит на экран следующую таблицу:*/
 	
	cout << "гг=====================================¬¬\n"
			<< "||\t       Vremena goda  \t       ||\n"
			<< "¦¦=====================================¦¦\n"
			<< "||   Zima ||  Vesna  ||  Leto  || Osen ||\n"
			<< "LL=====================================\n\n";
	
	
	cout <<     // ТУТ СПРОСИТЬ УЧИТЕЛЯ НА СЧЕТ ТАБЛИЦЫ, через chair не выходят
	
	
	cout << "\n\n\n";
		
		
	/*11.	**Создать приложение, которое выводит на экран следующую таблицу:*/	
	
		
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |      Simvol         |       Opisanie                                  | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\n              |       Perehod  no novuyu stroku                 | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\r              |       Vozvrat karretki                          | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\a              |       Podacha zvukovogo signala                 | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\b              |       Zateret odin simvol                       | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\t              |       Tabulacia                                 | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\\\              |       Vivod  \\                       	         | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\\'              |       Vivod  \\\'                       	         | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << " |     \\\"              |       Vivod \\\"                        	         | \n";
	cout << " +---------------------+-------------------------------------------------+ \n";
	cout << "\n\n\n";
		
		
	/*12.	***Разработать приложение, которое выводит на консоль корабль (рисунок из символов)*/	
		
		
	cout << " _____________________¶____________¶¶¶¶____________ \n";
	cout << " __________________¶¶¶¶¶¶¶_________¶_______________ \n";
	cout << " __________________¶__¶__¶_______¶¶¶¶¶_____________ \n";
	cout << " ____________¶_____¶__¶__¶_______¶_¶_¶_____________ \n";
	cout << " ____________¶¶___¶¶¶¶¶¶¶¶¶_____¶¶¶¶¶¶¶____________ \n";
	cout << " ____¶¶______¶¶¶__¶___¶___¶_____¶__¶__¶____________ \n";
	cout << " ____¶¶¶______¶___¶___¶____¶___¶___¶___¶___________ \n";
	cout << " ____¶¶¶¶__¶¶¶¶__¶___¶¶¶___¶__¶____¶____¶__________ \n";
	cout << " ____¶¶¶¶¶__¶¶¶_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__________ \n";
	cout << " _____¶__¶¶__¶¶¶______¶______¶_____¶____¶____¶¶_¶__ \n";
	cout << " _____¶¶¶¶____¶_______¶______¶_____¶_____¶__¶¶¶¶___ \n";
	cout << " ___¶¶¶¶¶¶¶___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶__ \n";
	cout << " ___¶¶¶¶¶¶¶¶¶¶¶¶¶_____¶_________¶¶¶¶¶¶¶__¶¶¶__¶¶¶__ \n";
	cout << " ____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___¶¶¶__¶¶¶¶¶¶¶¶¶¶¶_________ \n";
	cout << " ____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶___________ \n";
	cout << " ____¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____________ \n";
	cout << "\n\n\n";	
		
		
	/*15.	***Разработать приложение,  которое выводит на консоль пейзаж (рисунок из символов)*/	

	cout << "                                -;'  -.                          \n";
	cout << "                                  `.   `.                        \n";
	cout << "                                    ;    `                       \n";
	cout << "             `-  `.         .'`  .-'             .--`  ;         \n";
	cout << "              ;    `-.   ;    `-'             .;`     ;          \n";
	cout << "              .        ``                                        \n";
	cout << "               `            .--------.             .'            \n";
	cout << "             ...        .--'``````````'--.        ;.             \n";
	cout << "            `      . .-' .``          ``. '-. .      `.          \n";
	cout << "          ;-.;  .  .' .`                  `. '.  .    ;          \n";
	cout << "              .' .' .`                      `. '. '.    .        \n";
	cout << "_____/'.-..___________________________ mvn,, ___________________ \n";
	cout << "                             )\     nMmIEFooPTn                  \n";
	cout << "                            ( (    Li1iiJl1ItTIjp                \n";
	cout << "                             ) \  i i_BP_LWmKK`  J  `            \n";
	cout << "`                .          /  (   i1 LL 1I`L            .       \n";
	cout << "             ..             \   \  i   )  Y o1                   \n";
	cout << "                        .    )   )  `   l   p      ..            \n";
	cout << ";                           /   (,      l () l                .. \n";
	cout << "  q      ` .  '            (     \.     /    p   R          .;   \n";
	cout << "   \  t            ;        )     \`   ),.. ,.q,/Pqoj          ` \n";
	cout << "    \/            `       ./       \`;     `'     `          ..  \n";
	cout << "  '-     \;            -'.'    ;    \ `                     `. ` \n";
	cout << ".--.`.; ,-.. ,.-, ;' `.-'       `    `.'.   .--.""-._        .;  \n";
	cout << "    `............---""     ;_.         )   (  '=    /         `- \n";
	cout << " ~                                    /     `------'     .       \n";
	cout << "                 ~                  ,'  \|//            `'       \n";
	cout << "                ~           ~       ; `. ""                   .. \n";
	cout << "                                     `.  )                       \n";
	cout << "\n\n\n";
	
	
	/*16.	**Разработать приложение,  которое выводит на консоль круг (рисунок из символов)*/
	cout << "	           ooo OOO OOO ooo\n";
	cout << "               oOO                 OOo\n";
	cout << "           oOO                         OOo\n";
	cout << "        oOO                               OOo\n";
	cout << "      oOO                                   OOo\n";
	cout << "    oOO                                       OOo\n";
	cout << "   oOO                                         OOo\n";
	cout << "  oOO                                           OOo\n";
	cout << " oOO                                             OOo\n";
	cout << " oOO                                             OOo\n";
	cout << " oOO                                             OOo\n";
	cout << " oOO                                             OOo\n";
	cout << " oOO                                             OOo\n";
	cout << "  oOO                                           OOo\n";
	cout << "   oOO                                         OOo\n";
	cout << "    oOO                                       OOo\n";
	cout << "      oOO                                   OOo\n";
	cout << "        oO                                OOo\n";
	cout << "           oOO                         OOo\n";
	cout << "               oOO                 OOo\n";
	cout << "                   ooo OOO OOO ooo\n";
	cout << "\n\n\n";	
		
		
	/*17.	**Разработать приложение,  которое выводит на консоль круг, вписанный в квадрат (рисунок из символов)*/
    cout << "           \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\n";
    cout << "           \\n                      \\n\n";      
    cout << "           \\n                      \\n\n";     
    cout << "           \\n        ,gPPRg,       \\n\n";      
    cout << "           \\n       dP'   `Yb      \\n\n";      
    cout << "           \\n       8)     (8      \\n \n";        
    cout << "           \\n       Yb     dP      \\n \n";      
    cout << "           \\n        \"8ggg8\"       \\n\n";      
    cout << "           \\n                      \\n\n";      
    cout << "           \\n                      \\n\n";       
    cout << "           \\n            _         \\n\n";         
    cout << "           \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n";  	
	cout << "\n\n\n";	
	
	
	/*18.	**Разработать приложение,  которое выводит на консоль машинку (рисунок из символов)*/
	cout << "     ______  \n";
	cout << "    /|_||_\`.__ \n";
	cout << "   (   _    _ _\\ \n";
	cout << "   =`-(_)--(_)-'  hjw  \n";
	cout << "\n\n\n";	
	
	
	/*19.	***Разработать приложение, которое выводит на консоль следующий текст:*/
	cout << " /*Eto prostejshaja \n";
    cout << "\t\t programma*/\n";
    cout << " #include <iostream>\n";
    cout << " using namespace std;\n";
    cout << " void main()\n";
    cout << " {\n";
    cout << " cout<<\"\\nHello world\";\n";
    cout << "  }  \n";       
	cout << "\n\n\n";
	
	
	/*20.	***Разработать приложение, которое выводит на консоль следующий текст:*/
	cout << " #include <iostream> //eto biblioteka  \n";
    cout << " using namespace std;                  \n";
    cout << " void main()                          	\n";
    cout << " { 									\n";
    cout << "    cout<<\"\\n\\a\\a\\nHello world\";		\n";
    cout << "  }   									\n";
	cout << "\n\n\n";
		
		
	/*22.	***Разработать приложение, которое выводит на консоль следующий текст:*/	
	cout << "#include <iostream>		\n";
    cout << "using namespace std;		\n";
    cout << "void main()				\n";
    cout << "{\n";
    cout << "     cout<<\"Sozdavajte svoi proecti v papke: \";	\n";
    cout << "     cout<<\"D:\Academy\";	\n";
	cout << "}							\n";
		
	return 0;
}
